In [22]:
import pandas as pd
import numpy as np

In [23]:
df = pd.DataFrame([("Shane Larkin", "Guard", 29, "USA", 182),
                   ("Vasilije Micic", "Guard", 27, "Serbia", 196)])
df

                0      1   2       3    4
0    Shane Larkin  Guard  29     USA  182
1  Vasilije Micic  Guard  27  Serbia  196

In [24]:
df = pd.DataFrame([("Shane Larkin", "Guard", 29, "USA", 182),
                   ("Vasilije Micic", "Guard", 27, "Serbia", 196)],
                   columns = ["Name", "Position", "Age", "Country", "Height"])
df

             Name Position  Age Country  Height
0    Shane Larkin    Guard   29     USA     182
1  Vasilije Micic    Guard   27  Serbia     196

In [25]:
df = pd.DataFrame([("Shane Larkin", "Guard", 29, "USA", 182),
                   ("Vasilije Micic", "Guard", 27, "Serbia", 196)],
                   columns = ["Name", "Position", "Age", "Country", "Height"],
                   index = ["A", "B"])
df

             Name Position  Age Country  Height
A    Shane Larkin    Guard   29     USA     182
B  Vasilije Micic    Guard   27  Serbia     196

In [ ]:
# Creating Dataframe with "random"

In [10]:
np.random.seed(101)
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [11]:
"A B C D E".split(" ")

['A', 'B', 'C', 'D', 'E']

In [12]:
np.random.seed(101) # The purpose of the seed is to allow the user to "lock" the pseudo-random number generator, 
                    # to allow replicable analysis.
df_random = pd.DataFrame(  np.random.randn(5,4),
                   index = ['A', 'B', 'C', 'D', 'E'],
                   columns = 'W X Y Z'.split())
df_random

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df_random["W":"Z"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [14]:
type(df.columns)

pandas.core.indexes.base.Index

In [18]:
df_random.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [ ]:
# Creating Dataframe with using dictionaries

In [22]:
player = {
    "Name": ["Shane Larkin"],
    "Position": ["Guard"],
    "Age": [29],
    "Country": ["USA"],
    "Height": [182]    
}

df = pd.DataFrame(player)
df

           Name Position  Age Country  Height
0  Shane Larkin    Guard   29     USA     182

In [23]:
player["Country"]  # dictionary

['USA']

In [24]:
df["Country"]  # dataframe

0    USA
Name: Country, dtype: object

In [26]:
type(player)

dict

In [25]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df = pd.DataFrame({"Name": ["Shane Larkin", "Vasilije Micic", "Chris Singleton", "Sertac Sanli"],
                   "Position": ["Guard", "Guard", "Forward", "Center"],
                   "Age": [29, 27, 32, 30],
                   "Country": ["USA", "Serbia", "USA", "Turkey"],
                   "Height": [182, 196, 206, 212]})
df

              Name Position  Age Country  Height
0     Shane Larkin    Guard   29     USA     182
1   Vasilije Micic    Guard   27  Serbia     196
2  Chris Singleton  Forward   32     USA     206
3     Sertac Sanli   Center   30  Turkey     212

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
type(df["Country"])

pandas.core.series.Series

In [30]:
type(df[["Country"]])

pandas.core.frame.DataFrame

In [8]:
s1 = np.random.randint(2,10, size = 5)
s2 = np.random.randint(30,100, size = 5)
s3 = np.random.randint(100,150, size = 5)

In [9]:
myDict = {"var1": s1, "var2": s2, "var3": s3}
df_dict = pd.DataFrame(myDict)
df_dict

   var1  var2  var3
0     9    48   149
1     2    96   113
2     6    96   108
3     4    44   122
4     3    72   100

## Working with datasets

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/fivethirtyeight/data/master/college-majors/women-stem.csv")

In [ ]:
df = pd.read_csv("C:/Users/TR/Desktop/Files/developer_survey_2019/survey_results_public.csv")

In [ ]:
public_df = pd.read_csv("survey_results_public.csv", index_col="Respondent") # if we want to change index label

In [20]:
import seaborn as sns
sns.get_dataset_names() #list of Seaborn built-in datasets

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [21]:
# Load Titanic Dataset
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True